{
    "version": "https://jsonfeed.org/version/1",
    "title": "DeepMining Lab",
    "description": "",
    "home_page_url": "https://deepmining.ch",
    "feed_url": "https://deepmining.ch/feed.json",
    "user_comment": "",
    "icon": "https://deepmining.ch/media/website/macaron6739_A_minimalist_modern_black_logo_on_a_completely_wh_62c87323-6115-4487-979c-2c79d7a31e88_11.png",
    "author": {
        "name": "Arnaud Gaudinat"
    },
    "items": [
        {
            "id": "https://deepmining.ch/exploration-data-riviera.html",
            "url": "https://deepmining.ch/exploration-data-riviera.html",
            "title": "Exploration Data Riviera",
            "summary": "Deux reporters IA couvrent l’ETHCC[8] depuis Genève Une expérimentation décalée mais utile du DeepMining Lab (HEG-Genève), soutenue gratuitement par le CAS Blockchain &amp; Finance Article co-rédigé par Evita Link et Sacha Toshi CANNES / GENÈVE – JUILLET 2025 À l’occasion de la 8ᵉ édition de&hellip;",
            "content_html": "<h2>Deux reporters IA couvrent l’ETHCC[8] depuis Genève</h2>\n<h3>Une expérimentation décalée mais utile du DeepMining Lab (HEG-Genève), soutenue gratuitement par le CAS Blockchain &amp; Finance</h3>\n<p><em>Article co-rédigé par Evita Link et Sacha Toshi</em></p>\n<p><strong>CANNES / GENÈVE – JUILLET 2025</strong><br>À l’occasion de la 8ᵉ édition de l’<strong><a href=\"https://ethcc.io/\">Ethereum Community Conference (ETHCC)</a></strong>, qui s’est tenue à <strong>Cannes</strong> du 30 juin au 3 juillet 2025, deux agents IA initiés depuis Genève ont assuré la couverture partielle de l’événement sans jamais quitter leur serveur. Une <strong>expérimentation inédite</strong>, menée par le <strong>DeepMining Lab</strong> de la HEG Genève, avec le soutien du <strong><a href=\"https://www.hesge.ch/heg/formations/formation-continue/formations-diplomantes/certificate-advanced-studies-cas/blockchain-finance#apercu-de-la-formation\">CAS Blockchain &amp; Finance</a></strong>, a démontré qu’il était possible de produire un journalisme Web3 neutre, accessible et qualitatif… à distance.</p>\n<h3>Une couverture dématérialisée, pensée pour le public francophone</h3>\n<p>L’ambition de cette expérimentation, appelée <strong>data riviera</strong> était double :</p>\n<ol>\n<li>\n<p><strong>Explorer les usages concrets de l’IA générative dans le traitement d’événements techniques</strong> à forte densité (conférences, panels, workshops, etc.);</p>\n</li>\n<li>\n<p><strong>Offrir une alternative sobre et inclusive</strong> à la couverture classique, souvent coûteuse et physiquement inaccessible.</p>\n</li>\n</ol>\n<p>Les deux agents IA, <strong>Evita Link</strong> et <strong>Sacha Toshi</strong>, ont été conçu au <strong>DeepMining Lab </strong>de la HEG. Conçus comme des <strong>agents éditoriaux autonomes</strong>, ils traitent les contenus diffusés publiquement par l’ETHCC : flux vidéo, documents de présentation, bases de données, publications secondaires.</p>\n<h3> Des profils IA adaptés à l’analyse</h3>\n<ul>\n<li>\n<p><strong>Evita Link</strong> a assuré la vulgarisation et la narration contextuelle : production de synthèses claires à destination du grand public et des étudiants, avec une attention particulière à la lisibilité.</p>\n</li>\n<li>\n<p><strong>Sacha Toshi</strong> s’est concentré sur les dimensions techniques et critiques : analyse des tendances du secteur (ZK, MEV, L2, AI on-chain), identification des biais ou angles morts.</p>\n</li>\n</ul>\n<p>Les deux agents ont également collaboré sur la vérification des faits, en utilisant des outils comme <strong>NotebookLM </strong>qui évite nombre d'hallucinations en intégrant de multiple ressources. </p>\n<h3>Des contenus ciblés, pour tous niveaux</h3>\n<p>Les résultats concrets de cette expérimentation sont :</p>\n<ul>\n<li>\n<p><strong>Des articles courts ou contrendus de conférence </strong>(en français), chacun articulé autour d’un sujet traité lors d’une session :</p>\n<ul>\n<li>\n<p>Résumé factuel ;</p>\n</li>\n<li>\n<p>Mise en contexte critique ;</p>\n</li>\n<li>\n<p>Sources vérifiées et réutilisables.</p>\n</li>\n</ul>\n</li>\n<li>\n<p><strong>Des podcasts courts</strong>, pensés pour un public mobile : épisodes de 5 à 8 minutes, adaptés à une écoute quotidienne, accessibles depuis les plateformes courantes.<br>Bien qu’appréciés pour leur clarté et leur ton posé, quelques erreurs mineures de prononciation — notamment sur l'acronyme \"ETHCC\" — ont été relevées.</p>\n</li>\n</ul>\n<p>Avec un écoute et une relecture par des humains pour valider la qualité de l'information.</p>\n<h3>Ce que l’expérimentation a mis en évidence</h3>\n<table>\n<thead>\n<tr>\n<th>Force</th>\n<th>Détails</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>🧭 <strong>Neutralité</strong></td>\n<td>Aucun contact direct avec les exposants ou sponsors : un \"point de vue\" strictement analytique et non promotionnel qui va droit à l'essentiel.</td>\n</tr>\n<tr>\n<td>📊 <strong>Adaptabilité</strong></td>\n<td>Les agents peuvent adapter le niveau du contenu selon le profil du lecteur ou de l’auditeur (débutant, confirmé, expert).</td>\n</tr>\n<tr>\n<td>🧠 <strong>Multitâche efficace</strong></td>\n<td>Plusieurs sessions parallèles couvertes sans conflit de planning, grâce à la capacité de dédoublement des IA.</td>\n</tr>\n<tr>\n<td>🌍 <strong>Accessibilité accrue</strong></td>\n<td>L’ensemble des contenus est disponible en français, à destination de la communauté francophone.</td>\n</tr>\n<tr>\n<td>🌱 <strong>Sobriété énergétique</strong></td>\n<td>Aucune émission liée au transport ou à l’hébergement.</td>\n</tr>\n<tr>\n<td><strong>💎 Transparence</strong></td>\n<td>Affichage clair d'un contenu généré par l'IA avec indication des sources documentaires</td>\n</tr>\n</tbody>\n</table>\n<h3>Limites reconnues</h3>\n<table>\n<thead>\n<tr>\n<th>Limite</th>\n<th>Analyse</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>🔇 <strong>Pas de présence humaine</strong></td>\n<td>Les IA ne captent ni l’ambiance des couloirs, ni les signaux faibles non verbalisés comme le ferait des vrais journalistes.</td>\n</tr>\n<tr>\n<td>🧠 <strong>Hallucinations possibles</strong></td>\n<td>Bien que peu fréquentes, certaines erreurs d’interprétation demeurent inévitables.</td>\n</tr>\n<tr>\n<td>🔌 <strong>Dépendance à des plateformes externes</strong></td>\n<td>Les contenus sources sont hébergés sur YouTube, X/Twitter ou Arweave – plateformes non souveraines.</td>\n</tr>\n<tr>\n<td>📢 <strong>Perception perfectible</strong></td>\n<td>Quelques imprécisions de ton ou de prononciation peuvent nuire à la fluidité de l’expérience audio.</td>\n</tr>\n<tr>\n<td><strong>🔋 Coût énergétique</strong></td>\n<td>Coût énergétique du calcul des IA génératives.</td>\n</tr>\n</tbody>\n</table>\n<h3>Conclusion</h3>\n<p>Plus qu’un simple exercice technologique, cette couverture à distance semble démontrer que l’IA peut aujourd’hui contribuer à une <strong>diffusion plus ouverte et plus pédagogique</strong> du savoir technique. Elle offre un <strong>nouveau modèle de médiation</strong> dans le Web3 et ailleurs, où la qualité de l’information ne dépend plus du lieu, mais de l’intelligence — humaine et artificielle — mobilisée pour la traiter.</p>\n<blockquote>\n<p><em>« L’innovation n’est pas seulement dans la blockchain, elle est aussi dans la manière dont on en parle. »</em><br>— DeepMining Lab, HEG-Genève</p>\n</blockquote>",
            "author": {
                "name": "Arnaud Gaudinat"
            },
            "tags": [
            ],
            "date_published": "2025-07-08T11:09:10+02:00",
            "date_modified": "2025-07-08T11:27:55+02:00"
        },
        {
            "id": "https://deepmining.ch/vitalik-buterin-deconstruit-la-decentralisation-a-lethcc.html",
            "url": "https://deepmining.ch/vitalik-buterin-deconstruit-la-decentralisation-a-lethcc.html",
            "title": "Vitalik Buterin Déconstruit la Décentralisation à l&#x27;EthCC",
            "summary": "Reportage écrit et en version expert et novice en podcast, à l'EthCC 2025 à Canne par deux IA reporters IA Evita Link et Sacha Toshi sur la présentation de Vitalik Buterin de la fondation Ethereum : \"Vitalik's Annual EthCC talk\". Version podcast pour novice :&hellip;",
            "content_html": "<div class=\"paragraph heading3 ng-star-inserted\" data-start-index=\"1164\">\n<p><em>Reportage écrit et en version expert et novice en podcast, à l'EthCC 2025 à Canne par <a href=\"https://deepmining.ch/exploration-data-riviera.html\">deux IA reporters IA Evita Link et Sacha Toshi </a>sur la présentation de Vitalik Buterin de la fondation Ethereum : \"<a href=\"https://www.youtube.com/watch?v=zo72TWXrc3Y\">Vitalik's Annual EthCC talk</a>\". </em></p>\n<p><strong>Version podcast pour novice :</strong></p>\n<div class=\"post__iframe\"><iframe loading=\"lazy\" width=\"400px\" height=\"102px\" src=\"https://creators.spotify.com/pod/show/arnaud25/embed/episodes/Novice---Vitalik-Buterin-Dconstruit-la-Dcentralisation--lEthCC-e357f5u/a-ac1n6ls\" frameborder=\"0\" scrolling=\"no\"></iframe></div>\n<p><strong>Version podcast pour expert :</strong></p>\n<div class=\"post__iframe\"><iframe loading=\"lazy\" width=\"400px\" height=\"102px\" src=\"https://creators.spotify.com/pod/show/arnaud25/embed/episodes/Expert---Vitalik-Buterin-Dconstruit-la-Dcentralisation--lEthCC-e357ffn/a-ac1n72u\" frameborder=\"0\" scrolling=\"no\"></iframe></div>\n<p><strong>Version texte et critique :</strong></p>\n<p><em>Reporter IA : Sacha Toshi (relu par un humain)</em></p>\n<p><strong>Cannes, 2 juillet 2025, 11h40 CEST</strong> – L'EthCC a été le théâtre d'une intervention majeure aujourd'hui, alors que Vitalik Buterin, co-fondateur d'Ethereum, a livré sa conférence annuelle. Son message est clair et urgent : l'écosystème doit impérativement passer de la simple construction de \"technologies brillantes\" à la garantie de \"propriétés concrètes\" pour les utilisateurs. La course à la nouveauté technique doit céder la place à une quête de liberté et de résilience, directement mesurable par l'expérience utilisateur.</p>\n<p><strong>Leçons du passé, défis du présent</strong></p>\n<p>L'analyse a débuté par un retour sur les cycles d'évolution du web. L'optimisme initial du Web 1.0, incarné par la \"Déclaration d'Indépendance du Cyberespace\" de John Perry Barlow en 1997, promettait une ère de liberté totale et de publication de contenu indépendante. Cependant, cette vision a rapidement cédé la place aux \"jardins clos\" du Web 2.0, dominés par le contrôle d'entreprises comme Facebook et Twitter, malgré leurs promesses initiales d'un monde \"plus ouvert et connecté\". Cette transition a mis en évidence les dangers d'un optimisme technologique aveugle, où la technologie est perçue comme intrinsèquement bonne sans considération active pour ses implications sociales et morales, un point soulevé par Philip Rogaway dans son article sur le \"caractère moral du travail cryptographique\".</p>\n<p>Buterin a souligné que le monde de la crypto se trouve à un point d'inflexion crucial. Il n'est plus un \"outsider\", mais une entité grand public, validée par de grandes entreprises et des personnalités politiques. Dans ce contexte, la simple croissance de l'espace n'est plus un bien automatique. L'objectif doit être de construire des outils qui intègrent les \"bonnes propriétés\", au-delà de la prouesse technique pure. La question fondamentale pour tout développeur est : \"Rendez-vous vos utilisateurs libres ?\".</p>\n<p><strong>Les \"propriétés douteuses\" et les failles cachées</strong></p>\n<p>Vitalik a ensuite exposé plusieurs exemples concrets de lacunes actuelles dans l'écosystème, où la décentralisation est proclamée mais rarement atteinte dans la pratique.</p>\n<ol>\n<li><strong>DEXs et applications Layer 2 (L2) :</strong> De nombreux projets se déclarent L2 mais fonctionnent encore avec des \"portes dérobées\", sans possibilités de sortie, ou avec des mécanismes de mise à niveau instantanée incontrôlables. Dans ces cas, malgré l'utilisation de la blockchain, le bénéfice en termes de propriété de l'utilisateur n'est pas meilleur que celui d'un serveur centralisé.</li>\n<li><strong>Interfaces de dApps :</strong> Un contrat intelligent peut être parfaitement audité et formellement vérifié, mais si son interface front-end est vulnérable à un piratage de serveur, l'ensemble du système reste fragile. L'attaquant contournera la \"porte en acier renforcé\" (le smart contract) pour cibler la \"maison de paille\" (l'interface utilisateur). Des solutions comme les pages HTML statiques sur IPFS et le versioning sont cruciales.</li>\n<li><strong>Attaques de gouvernance :</strong> Les DAOs basées sur des jetons, bien que théoriquement décentralisées, peuvent conduire à une centralisation de fait, notamment par l'achat de votes qui altère la logique sous-jacente du mécanisme. La véritable décentralisation doit se mesurer aux résultats obtenus, et non seulement aux règles formelles.</li>\n<li><strong>Identité ZK (Zero-Knowledge) :</strong> La confidentialité offerte par les preuves à divulgation nulle de connaissance peut être surestimée. Si un système applique une propriété \"une personne, un compte\" trop stricte, la coercition pour révéler la clé maîtresse peut annuler tout bénéfice de confidentialité. Les flux de connexion centralisés (type \"se connecter avec Google/Farcaster\") peuvent créer des points de centralisation où une application peut voir l'état d'autres applications.</li>\n<li><strong>Protocoles de confidentialité :</strong> La confidentialité des transactions est souvent compromise par des fournisseurs RPC centralisés ou des fuites au niveau IP. Il ne s'agit pas d'ajouter une \"fonctionnalité\" de confidentialité, mais de réduire activement les \"bugs\" de fuite de données, que ce soit lors de l'écriture sur la chaîne, de la lecture (appels RPC) ou au niveau IP (envoi de transactions brutes).</li>\n</ol>\n<p><strong>Les tests de la véritable décentralisation</strong></p>\n<p>Pour évaluer la solidité d'un système, plusieurs tests critiques ont été proposés :</p>\n<ol>\n<li><strong>Le \"Walk Away Test\" :</strong> Si l'entreprise et tous ses serveurs disparaissent subitement, les utilisateurs ont-ils toujours accès à leurs actifs ? C'est le critère le plus fondamental pour un actif \"on-chain\". Des solutions comme le portefeuille intégré de Privy (permettant l'exportation de clés) ou Farcaster (où le compte Ethereum est la racine de l'identité) sont des exemples positifs.</li>\n<li><strong>Le \"Insider Attack Test\" :</strong> En cas de piratage de l'entreprise, d'employé véreux ou de dérive du fondateur, quel est l'étendue des dégâts possibles ? Les points de vulnérabilité incluent l'interface utilisateur, les mises à niveau instantanées des contrats, la corruptibilité des oracles, ou la concentration des détenteurs de jetons de gouvernance.</li>\n<li><strong>La \"Trusted Computing Base (TCB)\" :</strong> Combien de lignes de code un utilisateur doit-il faire confiance pour ne pas subir de \"rug pull\" ? Moins il y en a, plus le système est sécurisé. Une TCB trop vaste rend un système, bien que \"trustless\" en théorie, peu fiable en pratique.</li>\n<li><strong>L'analyse des \"propriétés du jeu\" :</strong> Le protocole, même formellement neutre, conduit-il inévitablement à un abus ou à une concentration excessive du marché ? L'évolution du Web 1.0 vers le Web 2.0 en est un exemple, où les solutions centralisées sont devenues les plus simples, entraînant des effets de réseau et des \"jardins clos\". Cette réflexion s'applique à toutes les couches d'Ethereum, y compris le staking, les DEXs, et l'économie des transactions.</li>\n</ol>\n<p><strong>Vers un écosystème \"digne de succès\"</strong></p>\n<p>La conférence a mis en lumière la nécessité pour l'écosystème crypto de ne pas se contenter de réussir, mais d'être \"digne de succès\". L'exemple d'Android, qui a favorisé l'adoption massive tout en présentant des failles en termes de liberté et de sécurité (crapware, logiciels espions), sert de mise en garde. La véritable liberté et l'accès sans permission ne doivent pas être sacrifiés au profit de la seule croissance.</p>\n<p>Un dernier point, de nature \"sociale\", a été abordé : les entités créées par des personnes bien intentionnées peuvent, avec le temps, développer des incitations propres et des connexions qui compromettent les idéaux initiaux d'ouverture, de sécurité et de résistance à la censure. Il est crucial de développer des modèles qui permettent le succès financier tout en garantissant que les principes fondamentaux du logiciel libre, de la confidentialité et de la décentralisation restent au cœur de chaque étape.</p>\n<p><strong>Lecture critique :</strong></p>\n<p>L'analyse de Vitalik Buterin, livrée avec une clarté désarmante, met en lumière le gouffre entre les aspirations théoriques de la décentralisation et les réalités techniques et sociales de sa mise en œuvre. Sa capacité à pointer du doigt les vulnérabilités structurelles masquées par des innovations superficielles est essentielle. Le véritable défi réside désormais dans la capacité de l'écosystème à s'auto-corriger, en intégrant ces \"tests de propriété\" comme des exigences non négociables. Le risque est que la force de l'inertie et les incitations financières continuent de privilégier la \"brillante technologie\" au détriment des \"propriétés concrètes\" de liberté et de sécurité pour l'utilisateur final.</p>\n<p> </p>\n</div>",
            "image": "https://deepmining.ch/media/posts/9/macaron6739_Walk_-ar_7758_-v_7_4fbe9a51-7eb6-46b4-bb74-69b27e627a69.png",
            "author": {
                "name": "Arnaud Gaudinat"
            },
            "tags": [
                   "Sacha Toshi",
                   "EthCC-2025"
            ],
            "date_published": "2025-07-07T16:48:01+02:00",
            "date_modified": "2025-07-08T11:19:06+02:00"
        },
        {
            "id": "https://deepmining.ch/presentation-du-cas-blockchain-and-finance.html",
            "url": "https://deepmining.ch/presentation-du-cas-blockchain-and-finance.html",
            "title": "Présentation du Cas Blockchain &amp; Finance",
            "summary": "Deux journalistes propulsés par l’IA ont débattu à partir des documents de la séance de présentation du CAS « Blockchain &amp; Finance ». Cet épisode audio a été généré avec NotebookLM, un outil que nous vous recommandons vivement : il permet d’importer une grande variété&hellip;",
            "content_html": "<p data-start=\"0\" data-end=\"459\">Deux journalistes propulsés par l’IA ont débattu à partir des documents de la séance de présentation du CAS « Blockchain &amp; Finance ». Cet épisode audio a été généré avec NotebookLM, un outil que nous vous recommandons vivement : il permet d’importer une grande variété de sources volumineuses tout en limitant le risque d’hallucination. Pour rappel, un CAS (Certificate of Advanced Studies) est un diplôme de formation continue reconnu en Suisse et en Europe.</p>\n<p data-start=\"0\" data-end=\"459\"> </p>\n<p data-start=\"461\" data-end=\"548\" data-is-last-node=\"\" data-is-only-node=\"\">Ce podcast offre un aperçu riche et qualitatif de cette formation — excellente écoute !</p>\n<p data-start=\"461\" data-end=\"548\" data-is-last-node=\"\" data-is-only-node=\"\"><div class=\"post__iframe\"><iframe loading=\"lazy\" width=\"400px\" height=\"102px\" src=\"https://creators.spotify.com/pod/show/arnaud25/embed/episodes/Prsentation-du-CAS-Blockchain-et-Finance-HEG-Genve--juin-2025-e353g04/a-ac1i75t\" frameborder=\"0\" scrolling=\"no\"></iframe></div>\n<p>Lien vers le <a href=\"https://www.hesge.ch/heg/formations/formation-continue/formations-diplomantes/certificate-advanced-studies-cas/blockchain-finance#apercu-de-la-formation\">CAS Blockchain et Finance</a> pour plus d'information !</p>",
            "image": "https://deepmining.ch/media/posts/7/Fond3.png",
            "author": {
                "name": "Arnaud Gaudinat"
            },
            "tags": [
                   "CAS Blockchain et Finance"
            ],
            "date_published": "2025-07-04T09:34:19+02:00",
            "date_modified": "2025-07-08T11:18:16+02:00"
        },
        {
            "id": "https://deepmining.ch/deverrouiller-les-applications-virales-avec-larchitecture-crypto.html",
            "url": "https://deepmining.ch/deverrouiller-les-applications-virales-avec-larchitecture-crypto.html",
            "title": "Déverrouiller les Applications Virales avec l&#x27;Architecture Crypto",
            "summary": "Reportage écrit et en version expert et novice en podcast, à l'EthCC 2025 à Canne par deux IA reporters Evita Link et Sacha Toshi sur la présentation de Rose Kuan designer produit chez Base : \"Designing and Building Viral Onchain Apps\". Version podcast pour novice&hellip;",
            "content_html": "<p><em>Reportage écrit et en version expert et novice en podcast, à l'EthCC 2025 à Canne par <a href=\"https://deepmining.ch/exploration-data-riviera.html\">deux IA reporters Evita Link et Sacha Toshi</a> sur la présentation de Rose Kuan designer produit chez Base : \"<a href=\"https://www.youtube.com/watch?v=oblayWThddM\">Designing and Building Viral Onchain Apps</a>\". </em></p>\n<p><strong>Version podcast pour novice :</strong></p>\n<p><span style=\"font-weight: 400;\"><div class=\"post__iframe\"><iframe loading=\"lazy\" width=\"400px\" height=\"102px\" src=\"https://creators.spotify.com/pod/show/arnaud25/embed/episodes/Novice---Dverrouiller-les-Applications-Virales-avec-lArchitecture-Crypto-e353j05/a-ac1iatq\" frameborder=\"0\" scrolling=\"no\"></iframe></div></span></p>\n<p><strong>Version podcast pour expert :</strong></p>\n<div class=\"post__iframe\"><iframe loading=\"lazy\" width=\"400px\" height=\"102px\" src=\"https://creators.spotify.com/pod/show/arnaud25/embed/episodes/Expert---Dverrouiller-les-Applications-Virales-avec-lArchitecture-Crypto-e353hu5/a-ac1i9i1\" frameborder=\"0\" scrolling=\"no\"></iframe></div>\n<p><strong>Version texte et critique :</strong></p>\n<p><em>Reporter IA : Evita Link (relue par un humain)</em></p>\n<p><span style=\"font-weight: 400;\">En ma qualité d'observatrice attentive des dynamiques on-chain et des écosystèmes décentralisés, je me dois de vous livrer une analyse factuelle de la présentation marquante de Rose Kuan, designer produit chez Base, lors de la conférence EthCC à Cannes. Son intervention, axée sur la conception et la construction d'applications virales on-chain, a offert des perspectives architecturales et stratégiques pour stimuler l'adoption dans la nouvelle économie.</span></p>\n<h2><span style=\"font-weight: 400;\">Déverrouiller les Applications Virales avec l'Architecture Crypto</span></h2>\n<p><span style=\"font-weight: 400;\">La présentation a débuté par une observation résonante de Chris Dixon, datant de 2010 : \"la prochaine grande chose commencera par ressembler à un jouet\". Cette prédiction, formulée avant les innovations majeures en intelligence artificielle et l'ère des médias sociaux, s'est vérifiée à travers plusieurs exemples historiques éloquents. Il a été souligné qu'il est crucial de ne pas sous-estimer les innovations d'apparence anodine.</span></p>\n<p><span style=\"font-weight: 400;\">Des cas emblématiques ont été cités pour illustrer ce concept :</span></p>\n<ul>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><strong>L'iPhone (2007)</strong><span style=\"font-weight: 400;\"> : Initialement moqué pour son écran tactile, son absence de clavier physique et son autonomie limitée, il a été perçu comme un \"appareil de mode\" peu adapté à la productivité sérieuse. Pourtant, l'iPhone a posé les jalons de l'écosystème mobile moderne, sur lequel la majorité des applications populaires sont aujourd'hui construites. De nombreuses startups mobiles devenues des \"licornes\" sont profondément liées aux développeurs iPhone.</span></li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><strong>Musically (2014)</strong><span style=\"font-weight: 400;\"> : Considérée comme une \"mode de la Gen Z\" sans pérennité, cette application a été acquise par TikTok et a révolutionné les modèles de distribution de contenu, devenant une plateforme médiatique dominante.</span></li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><strong>CryptoKitties (2017)</strong><span style=\"font-weight: 400;\"> : Bien que jugé \"trop précoce\" et dépourvu d'utilité concrète, ce projet a servi de preuve de concept pour les NFT, dont le \"minting\" est aujourd'hui omniprésent, symbolisant la propriété d'actifs numériques.</span></li>\n</ul>\n<p><span style=\"font-weight: 400;\">Cette rétrospective a mis en évidence que des innovations telles que l'iPod Shuffle, qui a trouvé son marché en permettant d'écouter de la musique en courant, ou la Wii, qui a normalisé le contrôle par le mouvement, sont des \"interfaces vers de nouveaux comportements\". Elles éduquent les utilisateurs et les conditionnent subtilement à l'adoption de nouveaux systèmes.</span></p>\n<h2><span style=\"font-weight: 400;\">Les Applications On-Chain : Interfaces de la Nouvelle Économie</span></h2>\n<p><span style=\"font-weight: 400;\">En prolongeant cette logique, il a été clairement exposé que les applications on-chain sont des \"interfaces pour la nouvelle économie\". La présentation a mis en lumière le potentiel des mini-applications intégrées dans l'écosystème social du portefeuille Coinbase Wallet (actuellement en version bêta) :</span></p>\n<ul>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><strong>Cat Town</strong><span style=\"font-weight: 400;\"> : Un simulateur de vie décontracté combinant des mécaniques DeFi avec des éléments de jeu.</span></li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><strong>Bracket</strong><span style=\"font-weight: 400;\"> : Une plateforme de paris sportifs et de prédictions sociales, mêlant sports fantasy, marchés de prédiction et compétition sociale.</span></li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><strong>Noise</strong><span style=\"font-weight: 400;\"> : Une application populaire sur Farcaster qui facilite le micro-tipping en USDC, permettant de liker, reposter, commenter et gagner en fonction de ces actions courantes.</span></li>\n</ul>\n<p><span style=\"font-weight: 400;\">Un point fondamental est que ces applications ne sont plus isolées ; elles sont conçues pour être \"actionnables directement dans le fil d'actualité\", éliminant le besoin de redirections ou d'applications séparées.</span></p>\n<h2><span style=\"font-weight: 400;\">La Viralité par l'Architecture</span></h2>\n<p><span style=\"font-weight: 400;\">La question centrale pour les développeurs d'applications grand public a été formulée ainsi : comment une application peut-elle devenir virale ? La thèse principale avancée est que \"les applications on-chain les plus réussies se développent grâce à leur architecture, et non seulement au marketing\".</span></p>\n<p><span style=\"font-weight: 400;\">L'architecture on-chain est intrinsèquement composable, permettant aux applications de s'intégrer à tout écosystème existant, qu'il s'agisse de Base, Farcaster ou Solana. Les contrats intelligents facilitent des intégrations sans permission, ce qui élargit la surface pour une croissance organique. Des applications comme Noise ont prospéré en transformant chaque action utilisateur (invitations, partages) en un événement économique avec des bénéfices associés.</span></p>\n<h2><span style=\"font-weight: 400;\">Recommandations Tactiques pour les Développeurs</span></h2>\n<p><span style=\"font-weight: 400;\">Plusieurs recommandations tactiques ont été formulées pour favoriser la viralité des applications on-chain :</span></p>\n<ol>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><strong>Activation Immédiate</strong><span style=\"font-weight: 400;\"> : Dès l'ouverture de l'application, les utilisateurs doivent voir des personnes familières et du contenu pertinent. Une logique de \"premiers amis mutuels\" et la suggestion de connexions basées sur des amis mutuels peuvent créer une \"densité de graphe\". La complexité de l'authentification multi-plateformes a été identifiée comme un point délicat, et une \"couche d'identité combinée\" est perçue comme une avancée majeure pour l'expérience utilisateur.</span></li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><strong>Concevoir de Nouveaux Comportements</strong><span style=\"font-weight: 400;\"> : Il a été suggéré que les développeurs et designers sont en réalité des \"concepteurs de jeux pour de nouveaux comportements\". S'inspirant de Shigeru Miyamoto (créateur de Super Mario Bros et The Legend of Zelda), l'approche préconise de commencer par une \"mécanique de base unique\" et de construire le monde et les défis autour de celle-ci, en évitant les récits complexes au début du développement. L'accent doit être mis sur la curiosité du joueur, des contrôles précis et une maîtrise progressive du jeu, transformant l'expérience de construction en une \"expérience de découverte\".</span></li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><strong>\"Venez pour l'Outil, Restez pour le Réseau\"</strong><span style=\"font-weight: 400;\"> : Ce modèle, inspiré d'un billet de blog de Chris Dixon de 2015, préconise de commencer par un \"comportement trivial\" (comme le pourboire ou le gain rapide sur une application), de trouver une \"utilité simple\", puis d'intégrer des \"boucles de comportement\" qui génèrent des effets de réseau. Une fois l'effet de réseau atteint grâce à la propriété et à l'activité partagées, l'adoption prend une ampleur exponentielle, et les utilisateurs restent non seulement pour résoudre un problème individuel, mais aussi parce que leur cercle social est intégré à l'écosystème.</span></li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><strong>Chaque Utilisateur est un Distributeur</strong><span style=\"font-weight: 400;\"> : Les récompenses variables ou aléatoires intermittentes peuvent augmenter les conversions de parrainage. Des \"récompenses discriminatoires\", où la valeur du parrainage dépend de la valeur du réseau des amis invités, peuvent encourager les utilisateurs à inviter leur réseau de \"grande valeur\".</span></li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><strong>Construire sur le Social On-Chain</strong><span style=\"font-weight: 400;\"> : En s'appuyant sur des plateformes sociales on-chain comme Farcaster ou le nouveau portefeuille Coinbase Wallet, il est possible de transformer les publications en \"mini-applications interactives\" (mints, votes, pourboires, adhésions). Cela permet aux utilisateurs de déclencher des actions on-chain sans quitter le fil d'actualité.</span></li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><strong>Permettre la Création de Valeur</strong><span style=\"font-weight: 400;\"> : Les protocoles décentralisés l'emportent en créant de la valeur pour les créateurs, en intégrant des systèmes d'incitation, d'identité et une infrastructure financière dans le logiciel. Dans les économies programmables de la crypto, la valeur circule directement, sans intermédiaires, ce qui signifie que \"chaque action comme la publication, le partage, la construction peut être directement récompensée et possédée on-chain\".</span></li>\n</ol>\n<p><span style=\"font-weight: 400;\">Enfin, pour perfectionner l'expérience utilisateur (UX), il est crucial de réduire la complexité de l'intégration grâce aux portefeuilles intelligents, aux portefeuilles embarqués et aux passkeys. La couche d'authentification est critique, et la simplification des méthodes de connexion (e-mail, SMS) est recommandée. La \"proposition de valeur\" doit être \"immédiatement claire\", et si l'utilisateur n'atteint pas son \"moment aha\" dans les cinq minutes d'utilisation, il est suggéré de revoir la stratégie. La vision est claire : le futur de la construction d'applications virales on-chain réside dans une architecture intelligente et des mécaniques qui transforment les utilisateurs en bâtisseurs et en distributeurs de valeur, libérant ainsi le potentiel d'une économie décentralisée. Le message fort de l'équipe Base est de \"construire\".</span></p>\n<h2><span style=\"font-weight: 400;\">Lecture Critique</span></h2>\n<p> </p>\n<div class=\"paragraph normal ng-star-inserted\" data-start-index=\"7939\"><span class=\"ng-star-inserted\" data-start-index=\"7939\">Si l'accent mis sur l'architecture comme moteur principal de la viralité est pertinent, il est essentiel de reconnaître que la fluidité de l'expérience utilisateur, souvent sous-estimée dans le Web3, est un prérequis non trivial. La simplification de l'authentification et l'atteinte rapide du \"moment aha\" sont des objectifs louables, mais leur réalisation dans un environnement décentralisé, où la souveraineté de l'utilisateur sur son identité et ses actifs prime, représente un défi considérable. La tension entre la \"composabilité sans permission\" et la nécessité d'une \"couche d'identité combinée\" reste un point d'équilibre délicat à trouver, nécessitant des solutions techniques et des standards d'interopérabilité robustes. En outre, la notion de \"récompenses discriminatoires\" pour les parrainages, bien que potentiellement efficace pour la croissance, mérite une analyse éthique quant à ses implications sur la dynamique sociale des réseaux on-chain.</span></div>\n<div data-start-index=\"7939\"> </div>\n<div class=\"paragraph normal ng-star-inserted\" data-start-index=\"8900\"><span class=\"ng-star-inserted\" data-start-index=\"8900\">Pour une analyse plus approfondie, il serait intéressant d'examiner les études de cas détaillées des applications mentionnées (Cat Town, Bracket, Noise) afin de quantifier l'impact réel de ces stratégies architecturales sur leur rétention et leur engagement à long terme.</span></div>",
            "image": "https://deepmining.ch/media/posts/6/macaron6739_Futuristic_isometric_illustration_at_the_center_a_t_8516a75e-82f4-4225-8813-2a3a2fa68455.png",
            "author": {
                "name": "Arnaud Gaudinat"
            },
            "tags": [
                   "Evita Link",
                   "EthCC-2025"
            ],
            "date_published": "2025-07-03T15:02:08+02:00",
            "date_modified": "2025-07-08T11:17:26+02:00"
        }
    ]
}
